#### Terraform working directory 🏠: `demo/demo-account/network/vpc`
#### Terraform Format and Style 🖌: `success`
#### Terraform Initialization ⚙️: `success`
#### Terraform Plan 📖: `success`
<details><summary>Show Plan</summary>

```hcl
terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.vpc.module.default_endpoints["VPC-SGP-TST-C-1"].aws_vpc_endpoint.this["dynamodb"] will be updated in-place
  ~ resource "aws_vpc_endpoint" "this" {
        id                    = "vpce-0858c52307756d718"
      ~ tags                  = {
          + "Name" = "com.amazonaws.ap-southeast-1.dynamodb"
        }
      ~ tags_all              = {
          + "Name" = "com.amazonaws.ap-southeast-1.dynamodb"
        }
        # (16 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.vpc.module.default_endpoints["VPC-SGP-TST-C-1"].aws_vpc_endpoint.this["s3"] will be updated in-place
  ~ resource "aws_vpc_endpoint" "this" {
        id                    = "vpce-01c127b2b44a65694"
      ~ tags                  = {
          + "Name" = "com.amazonaws.ap-southeast-1.s3"
        }
      ~ tags_all              = {
          + "Name" = "com.amazonaws.ap-southeast-1.s3"
        }
        # (16 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.vpc.module.extra_endpoints["Eric-Test-VPC"].data.aws_route_tables.this["s3_Gateway"] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_route_tables" "this" {
      + id     = (known after apply)
      + ids    = (known after apply)
      + tags   = (known after apply)
      + vpc_id = (known after apply)

      + filter {
          + name   = "tag:Name"
          + values = [
              + "Eric-Test-VPC-PUBLIC-RT",
              + "Eric-Test-VPC-Private-RT",
            ]
        }
    }

  # module.vpc.module.extra_endpoints["Eric-Test-VPC"].data.aws_security_groups.this["s3_Interface"] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_security_groups" "this" {
      + arns    = (known after apply)
      + id      = (known after apply)
      + ids     = (known after apply)
      + tags    = (known after apply)
      + vpc_ids = (known after apply)

      + filter {
          + name   = "group-name"
          + values = [
              + "default",
            ]
        }
      + filter {
          + name   = "vpc-id"
          + values = [
              + (known after apply),
            ]
        }
    }

  # module.vpc.module.extra_endpoints["Eric-Test-VPC"].data.aws_subnets.this["s3_Interface"] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_subnets" "this" {
      + id   = (known after apply)
      + ids  = (known after apply)
      + tags = (known after apply)

      + filter {
          + name   = "tag:Name"
          + values = [
              + "Eric-Test-VPC-Intra-a",
              + "Eric-Test-VPC-Intra-b",
            ]
        }
      + filter {
          + name   = "vpc-id"
          + values = [
              + (known after apply),
            ]
        }
    }

  # module.vpc.module.extra_endpoints["Eric-Test-VPC"].aws_vpc_endpoint.this["s3_Gateway"] will be created
  + resource "aws_vpc_endpoint" "this" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = false
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.ap-southeast-1.s3"
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags                  = {
          + "Name" = "s3-gateway-endpoint"
        }
      + tags_all              = {
          + "Name" = "s3-gateway-endpoint"
        }
      + vpc_endpoint_type     = "Gateway"
      + vpc_id                = (known after apply)

      + timeouts {
          + create = "10m"
          + delete = "10m"
          + update = "10m"
        }
    }

  # module.vpc.module.extra_endpoints["Eric-Test-VPC"].aws_vpc_endpoint.this["s3_Interface"] will be created
  + resource "aws_vpc_endpoint" "this" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = false
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.ap-southeast-1.s3"
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags                  = {
          + "Name" = "s3-interface-endpoint"
        }
      + tags_all              = {
          + "Name" = "s3-interface-endpoint"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = (known after apply)

      + timeouts {
          + create = "10m"
          + delete = "10m"
          + update = "10m"
        }
    }

  # module.vpc.module.vpc["Eric-Test-VPC"].aws_default_security_group.this[0] will be created
  + resource "aws_default_security_group" "this" {
      + arn                    = (known after apply)
      + description            = (known after apply)
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "Eric-Test-VPC"
        }
      + tags_all               = {
          + "Name" = "Eric-Test-VPC"
        }
      + vpc_id                 = (known after apply)
    }

  # module.vpc.module.vpc["Eric-Test-VPC"].aws_internet_gateway.this[0] will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "Eric-Test-VPC"
        }
      + tags_all = {
          + "Name" = "Eric-Test-VPC"
        }
      + vpc_id   = (known after apply)
    }

  # module.vpc.module.vpc["Eric-Test-VPC"].aws_route_table.intra[0] will be created
  + resource "aws_route_table" "intra" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name"           = "Eric-Test-VPC-Intra-RT"
          + "RouteTableType" = "intra"
        }
      + tags_all         = {
          + "Name"           = "Eric-Test-VPC-Intra-RT"
          + "RouteTableType" = "intra"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.module.vpc["Eric-Test-VPC"].aws_route_table.public[0] will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name"           = "Eric-Test-VPC-PUBLIC-RT"
          + "RouteTableType" = "public"
        }
      + tags_all         = {
          + "Name"           = "Eric-Test-VPC-PUBLIC-RT"
          + "RouteTableType" = "public"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.module.vpc["Eric-Test-VPC"].aws_route_table_association.intra[0] will be created
  + resource "aws_route_table_association" "intra" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.module.vpc["Eric-Test-VPC"].aws_route_table_association.intra[1] will be created
  + resource "aws_route_table_association" "intra" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.module.vpc["Eric-Test-VPC"].aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.module.vpc["Eric-Test-VPC"].aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.module.vpc["Eric-Test-VPC"].aws_subnet.intra[0] will be created
  + resource "aws_subnet" "intra" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.17.64.0/19"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Account"     = "Lab"
          + "Environment" = "Sandbox"
          + "Name"        = "Eric-Test-VPC-Intra-a"
        }
      + tags_all                                       = {
          + "Account"     = "Lab"
          + "Environment" = "Sandbox"
          + "Name"        = "Eric-Test-VPC-Intra-a"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.module.vpc["Eric-Test-VPC"].aws_subnet.intra[1] will be created
  + resource "aws_subnet" "intra" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.17.96.0/19"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Account"     = "Lab"
          + "Environment" = "Sandbox"
          + "Name"        = "Eric-Test-VPC-Intra-b"
        }
      + tags_all                                       = {
          + "Account"     = "Lab"
          + "Environment" = "Sandbox"
          + "Name"        = "Eric-Test-VPC-Intra-b"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.module.vpc["Eric-Test-VPC"].aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.17.192.0/19"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Account"     = "Lab"
          + "Environment" = "Sandbox"
          + "Name"        = "Eric-Test-VPC-Public-a"
        }
      + tags_all                                       = {
          + "Account"     = "Lab"
          + "Environment" = "Sandbox"
          + "Name"        = "Eric-Test-VPC-Public-a"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.module.vpc["Eric-Test-VPC"].aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.17.224.0/19"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Account"     = "Lab"
          + "Environment" = "Sandbox"
          + "Name"        = "Eric-Test-VPC-Public-b"
        }
      + tags_all                                       = {
          + "Account"     = "Lab"
          + "Environment" = "Sandbox"
          + "Name"        = "Eric-Test-VPC-Public-b"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.module.vpc["Eric-Test-VPC"].aws_vpc.this[0] will be created
  + resource "aws_vpc" "this" {
      + arn                                  = (known after apply)
      + assign_generated_ipv6_cidr_block     = false
      + cidr_block                           = "172.17.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Account"     = "Lab"
          + "Environment" = "Sandbox"
          + "Name"        = "Eric-Test-VPC"
        }
      + tags_all                             = {
          + "Account"     = "Lab"
          + "Environment" = "Sandbox"
          + "Name"        = "Eric-Test-VPC"
        }
    }

  # module.vpc.module.vpc["Eric-Test-VPC"].aws_vpc_dhcp_options.this[0] will be created
  + resource "aws_vpc_dhcp_options" "this" {
      + arn                  = (known after apply)
      + domain_name          = "abc.example.com"
      + domain_name_servers  = [
          + "10.0.0.1",
          + "10.0.0.2",
        ]
      + id                   = (known after apply)
      + netbios_name_servers = []
      + ntp_servers          = [
          + "169.254.169.123",
          + "10.10.10.10",
        ]
      + owner_id             = (known after apply)
      + tags                 = {
          + "Name" = "Eric-Test-VPC"
        }
      + tags_all             = {
          + "Name" = "Eric-Test-VPC"
        }
    }

  # module.vpc.module.vpc["Eric-Test-VPC"].aws_vpc_dhcp_options_association.this[0] will be created
  + resource "aws_vpc_dhcp_options_association" "this" {
      + dhcp_options_id = (known after apply)
      + id              = (known after apply)
      + vpc_id          = (known after apply)
    }

Plan: 17 to add, 2 to change, 0 to destroy.

```

</details>

**Pusher**: @bitzhouwen
**Action**: pull_request
